#+TITLE:       Elixir 0-Arity Functions: Drop the Parens?
#+AUTHOR:      Thomas Moulia
#+EMAIL:       jtmoulia@gmail.com
#+DATE:        2015-03-12 Thu
#+URI:         /blog/%y/%m/%d/elixir-fun-call-parens
#+KEYWORDS:    elixir, style, erlang, parentheses, parens, function, variable
#+TAGS:        elixir, style
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: Include the parens when calling 0 arity functions?

A question [[https://github.com/niftyn8/elixir_style_guide][from github]]: =func= or =func()= ? And, my opinion...

tl;dr; consistent use of trailing parens increases code clarity by
explicitly signaling whether a reference is being used as a function
call or a variable. Style decisions are case by case, but I'd default
to keeping the parens when calling a 0 arity function.

* Elixir + Barewords

  Elixir's Ruby heritage is apparent in its expressive and flexible
  syntax -- Elixir is unabashed about adding syntactic sugar to make
  your life easier.

  In particular, it carries over what Avdi Grimm calls Ruby's
  "barewords", references without decoration which can refer to
  different things depending on the context. While it sounds exotic,
  barewords are fundamental to the Elixir, e.g. variable references
  are barewords. =thing= or =Module.thing= is a bareword, while
  =thing()= or =Module= are not. Functions without arguments may be
  called using the function's name as a bareword, i.e. =func= and
  =func()=.

  In Elixir, a bareword is evaluated by first checking the bareword's
  name (the bareword itself) against variables in the context. If it
  isn't a defined variable, Elixir attempts to call the name as a
  function with no arguments. This doesn't have any special error
  handling: a =RuntimeError= is raised if the function is undefined:

  #+begin_src elixir
    iex> a
    ** (RuntimeError) undefined function: a/0

    iex> a()
    ** (RuntimeError) undefined function: a/0
  #+end_src

  Here's an example of how barewords are first checked against the
  variables in the context, then called as a function:

  #+headers: :exports both
  #+begin_src elixir
    defmodule Example do

      def five, do: 5

      @doc """
      Returns the function `five`, 5 in this case, plus `x`.
      """
      def five_plus_fn(x) do
        five + x
      end

      @doc """
      Returns the variable `five`, 4 in this case, plus `x`.
      """
      def five_plus_var(x) do
        five = 4
        five + x
      end
    end

    IO.inspect [[:five_plus_fn,  Example.five_plus_fn(5)],
                [:five_plus_var, Example.five_plus_var(5)]]
  #+end_src

  #+RESULTS:
  | :five_plus_fn  | 10 |
  | :five_plus_var |  9 |


** Piping

   Empty trailing parentheses are unnecessary when using the pipe
   macro.

   A simple, contrived example:

   #+header: :exports both
   #+begin_src elixir
     1..10
       |> Enum.count
       |> IO.inspect
   #+end_src

   #+RESULTS:
   : 10

   When using piping, there is /no/ ambiguity about what =Enum.count=
   is referring to: it's being called as function with one
   argument. Empty trailing parens provide no additional information.

   However, in practice you'll often find yourself piping through
   functions which take more than one argument, which muddies the
   parens aesthetic situation a bit:

   #+header: :exports both
   #+begin_src elixir
     1..10
       |> Enum.filter(&(rem(&1, 2) == 0))
       |> Enum.count
       |> IO.inspect
   #+end_src

   #+RESULTS:
   : 5

   In sum, dropping parens when piping doesn't introduce ambiguity for
   the reader. Use what works best for your situation.

